Masmiseim36/nxpSDK/boards/frdmimxrt1186/demo_apps/mc_pmsm/pmsm_servo/cm7/pin_mux.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
 
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_EMC_B1_11 (coord D3), LED_GREEN_CTL */
/* Routed pin properties */
#define BOARD_INITPINS_LED_GREEN_CTL_PERIPHERAL                           RGPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_LED_GREEN_CTL_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LED_GREEN_CTL_CHANNEL                                 11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_GREEN_CTL_GPIO                                 RGPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_GREEN_CTL_INIT_GPIO_VALUE                          0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_LED_GREEN_CTL_GPIO_PIN                                11U   /*!< GPIO pin number */
#define BOARD_INITPINS_LED_GREEN_CTL_GPIO_PIN_MASK                   (1U << 11U)   /*!< GPIO pin mask */

/* GPIO_AON_18 (coord B5), TP_J3_16 */
/* Routed pin properties */
#define BOARD_INITPINS_TP_J3_16_PERIPHERAL                                RGPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_TP_J3_16_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TP_J3_16_CHANNEL                                      18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TP_J3_16_GPIO                                      RGPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TP_J3_16_GPIO_PIN                                     18U   /*!< GPIO pin number */
#define BOARD_INITPINS_TP_J3_16_GPIO_PIN_MASK                        (1U << 18U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

/* GPIO_AD_12 (coord M13), CUR_A */
/* Routed pin properties */
#define BOARD_INITADC_CUR_A_PERIPHERAL                                      ADC1   /*!< Peripheral name */
#define BOARD_INITADC_CUR_A_SIGNAL                                             A   /*!< Signal name */
#define BOARD_INITADC_CUR_A_CHANNEL                                           1U   /*!< Signal channel */

/* GPIO_AD_13 (coord M12), CUR_B */
/* Routed pin properties */
#define BOARD_INITADC_CUR_B_PERIPHERAL                                      ADC1   /*!< Peripheral name */
#define BOARD_INITADC_CUR_B_SIGNAL                                             B   /*!< Signal name */
#define BOARD_INITADC_CUR_B_CHANNEL                                           1U   /*!< Signal channel */

/* GPIO_AD_29 (coord M14), CUR_C */
/* Routed pin properties */
#define BOARD_INITADC_CUR_C_PERIPHERAL                                      ADC2   /*!< Peripheral name */
#define BOARD_INITADC_CUR_C_SIGNAL                                             B   /*!< Signal name */
#define BOARD_INITADC_CUR_C_CHANNEL                                           2U   /*!< Signal channel */

/* GPIO_AD_14 (coord M11), VOLT_DCB */
/* Routed pin properties */
#define BOARD_INITADC_VOLT_DCB_PERIPHERAL                                   ADC1   /*!< Peripheral name */
#define BOARD_INITADC_VOLT_DCB_SIGNAL                                          A   /*!< Signal name */
#define BOARD_INITADC_VOLT_DCB_CHANNEL                                        1U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC(void);                     /* Function assigned for the Cortex-M7F */

#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_15_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT15 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_23_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT23 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_9_XBAR 0x01U /*!< IOMUXC XBAR_INOUT9 function direction select: XBAR_INOUT as output */

/* GPIO_EMC_B1_12 (coord E5), PWM_AT */
/* Routed pin properties */
#define BOARD_INITPWM_PWM_AT_PERIPHERAL                                     PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_PWM_AT_SIGNAL                                            A   /*!< Signal name */
#define BOARD_INITPWM_PWM_AT_CHANNEL                                          0U   /*!< Signal channel */

/* GPIO_EMC_B1_13 (coord E3), PWM_AB */
/* Routed pin properties */
#define BOARD_INITPWM_PWM_AB_PERIPHERAL                                     PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_PWM_AB_SIGNAL                                            B   /*!< Signal name */
#define BOARD_INITPWM_PWM_AB_CHANNEL                                          0U   /*!< Signal channel */

/* GPIO_EMC_B1_14 (coord F4), PWM_BT */
/* Routed pin properties */
#define BOARD_INITPWM_PWM_BT_PERIPHERAL                                     PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_PWM_BT_SIGNAL                                            A   /*!< Signal name */
#define BOARD_INITPWM_PWM_BT_CHANNEL                                          1U   /*!< Signal channel */

/* GPIO_EMC_B1_15 (coord D1), PWM_BB */
/* Routed pin properties */
#define BOARD_INITPWM_PWM_BB_PERIPHERAL                                     PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_PWM_BB_SIGNAL                                            B   /*!< Signal name */
#define BOARD_INITPWM_PWM_BB_CHANNEL                                          1U   /*!< Signal channel */

/* GPIO_EMC_B1_17 (coord B1), PWM_CT */
/* Routed pin properties */
#define BOARD_INITPWM_PWM_CT_PERIPHERAL                                     PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_PWM_CT_SIGNAL                                            A   /*!< Signal name */
#define BOARD_INITPWM_PWM_CT_CHANNEL                                          2U   /*!< Signal channel */

/* GPIO_EMC_B1_16 (coord E2), PWM_CB */
/* Routed pin properties */
#define BOARD_INITPWM_PWM_CB_PERIPHERAL                                     PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_PWM_CB_SIGNAL                                            B   /*!< Signal name */
#define BOARD_INITPWM_PWM_CB_CHANNEL                                          2U   /*!< Signal channel */

/* GPIO_SD_B1_03 (coord E10), OC_FAULT */
/* Routed pin properties */
#define BOARD_INITPWM_OC_FAULT_PERIPHERAL                                   PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_OC_FAULT_SIGNAL                                      FAULT   /*!< Signal name */
#define BOARD_INITPWM_OC_FAULT_CHANNEL                                        0U   /*!< Signal channel */

/* GPIO_EMC_B1_39 (coord K1), OV_FAULT */
/* Routed pin properties */
#define BOARD_INITPWM_OV_FAULT_PERIPHERAL                                   PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_OV_FAULT_SIGNAL                                      FAULT   /*!< Signal name */
#define BOARD_INITPWM_OV_FAULT_CHANNEL                                        1U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWM(void);                     /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPUART(void);                  /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_00 (coord G3), M1_ENDATA_DATA_IN_ENC_A */
/* Routed pin properties */
#define BOARD_INITENC_M1_ENDATA_DATA_IN_ENC_A_PERIPHERAL                 FLEXIO1   /*!< Peripheral name */
#define BOARD_INITENC_M1_ENDATA_DATA_IN_ENC_A_SIGNAL                          IO   /*!< Signal name */
#define BOARD_INITENC_M1_ENDATA_DATA_IN_ENC_A_CHANNEL                         0U   /*!< Signal channel */

/* GPIO_EMC_B1_01 (coord F5), M1_ENDAT_DIR_ENC_B */
/* Routed pin properties */
#define BOARD_INITENC_M1_ENDAT_DIR_ENC_B_PERIPHERAL                      FLEXIO1   /*!< Peripheral name */
#define BOARD_INITENC_M1_ENDAT_DIR_ENC_B_SIGNAL                               IO   /*!< Signal name */
#define BOARD_INITENC_M1_ENDAT_DIR_ENC_B_CHANNEL                              1U   /*!< Signal channel */

/* GPIO_EMC_B1_03 (coord E6), M1_ENDAT_DATA_OUT_ENC_HOME */
/* Routed pin properties */
#define BOARD_INITENC_M1_ENDAT_DATA_OUT_ENC_HOME_PERIPHERAL              FLEXIO1   /*!< Peripheral name */
#define BOARD_INITENC_M1_ENDAT_DATA_OUT_ENC_HOME_SIGNAL                       IO   /*!< Signal name */
#define BOARD_INITENC_M1_ENDAT_DATA_OUT_ENC_HOME_CHANNEL                      3U   /*!< Signal channel */

/* GPIO_EMC_B1_02 (coord G2), M1_ENDAT_CLK_ENC_I */
/* Routed pin properties */
#define BOARD_INITENC_M1_ENDAT_CLK_ENC_I_PERIPHERAL                      FLEXIO1   /*!< Peripheral name */
#define BOARD_INITENC_M1_ENDAT_CLK_ENC_I_SIGNAL                               IO   /*!< Signal name */
#define BOARD_INITENC_M1_ENDAT_CLK_ENC_I_CHANNEL                              2U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENC(void);                     /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSINC(void);                    /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
